In [3]:
import pandas as pd
import numpy as np

## 데이터 프레임 생성

In [4]:
df = pd.DataFrame(np.arange(16).reshape(4,4), columns=['a','b','c','d'])
print(df)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4), columns=['a','b','c','d'])
print(df1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## 산술연산

In [6]:
df + df1

    a   b   c   d
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22
3  24  26  28  30

In [7]:
df - df1

   a  b  c  d
0  0  0  0  0
1  0  0  0  0
2  0  0  0  0
3  0  0  0  0

In [8]:
df * df1

     a    b    c    d
0    0    1    4    9
1   16   25   36   49
2   64   81  100  121
3  144  169  196  225

In [9]:
df / df1

     a    b    c    d
0  NaN  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0

In [10]:
df // df1

     a    b    c    d
0  NaN  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0

## 비교 연산

In [11]:
df < df1

       a      b      c      d
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [12]:
df == df1

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

In [13]:
df > df1

       a      b      c      d
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [14]:
df >= df1

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

## 행렬 연산

In [20]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
df1.T

   0  1   2   3
a  0  4   8  12
b  1  5   9  13
c  2  6  10  14
d  3  7  11  15

In [19]:
df.dot(df1.T)

    0    1    2    3
0  14   38   62   86
1  38  126  214  302
2  62  214  366  518
3  86  302  518  734